GB2312区位码:
    code  +0 +1 +2 +3 +4 +5 +6 +7 +8 +9 +A +B +C +D +E +F  
  0x0300     ！ ＂ ＃ ￥ ％ ＆ ＇ （ ） ＊ ＋ ， － ． ／  
  0x0310  ０ １ ２ ３ ４ ５ ６ ７ ８ ９ ： ； ＜ ＝ ＞ ？  
  0x0320  ＠ Ａ Ｂ Ｃ Ｄ Ｅ Ｆ Ｇ Ｈ Ｉ Ｊ Ｋ Ｌ Ｍ Ｎ Ｏ  
  0x0330  Ｐ Ｑ Ｒ Ｓ Ｔ Ｕ Ｖ Ｗ Ｘ Ｙ Ｚ ［ ＼ ］ ＾ ＿  
  0x0340  ｀ ａ ｂ ｃ ｄ ｅ ｆ ｇ ｈ ｉ ｊ ｋ ｌ ｍ ｎ ｏ  
  0x0350  ｐ ｑ ｒ ｓ ｔ ｕ ｖ ｗ ｘ ｙ ｚ ｛ ｜ ｝ ￣    


  
GB2312区码+2020(国际码):
    code  +0 +1 +2 +3 +4 +5 +6 +7 +8 +9 +A +B +C +D +E +F  
  0x2320     ！ ＂ ＃ ￥ ％ ＆ ＇ （ ） ＊ ＋ ， － ． ／  
  0x2330  ０ １ ２ ３ ４ ５ ６ ７ ８ ９ ： ； ＜ ＝ ＞ ？  
  0x2340  ＠ Ａ Ｂ Ｃ Ｄ Ｅ Ｆ Ｇ Ｈ Ｉ Ｊ Ｋ Ｌ Ｍ Ｎ Ｏ  
  0x2350  Ｐ Ｑ Ｒ Ｓ Ｔ Ｕ Ｖ Ｗ Ｘ Ｙ Ｚ ［ ＼ ］ ＾ ＿  
  0x2360  ｀ ａ ｂ ｃ ｄ ｅ ｆ ｇ ｈ ｉ ｊ ｋ ｌ ｍ ｎ ｏ  
  0x2370  ｐ ｑ ｒ ｓ ｔ ｕ ｖ ｗ ｘ ｙ ｚ ｛ ｜ ｝ ￣  

从上面可以看出：
字符"！"的编码为：0x2321,高字节0x23在ASCI中代表字符"#",低字节0x21在ASCII中代表字符"!"
字符"＂"的编码为：0x2322,高字节0x23在ASCI中代表字符"#",低字节0x22在ASCII中代表字符"”"

ASCI表格：
Hex	字符	Hex	字符
0x20	(space)	0x30	0
0x21	!	0x31	1
0x22	"	0x32	2
0x23	#	0x33	3
0x24	$	0x34	4
0x25	%	0x35	5
0x26	&	0x36	6
0x27	'	0x37	7
0x28	(	0x38	8
0x29	)	0x39	9
0x2A	*	0x3A	:
0x2B	+	0x3B	;
0x2C	,	0x3C	<
0x2D	-	0x3D	=
0x2E	.	0x3E	>
0x2F	/	0x3F	?
