/***************************************************************************************************
Author:liu.hao

Time:2018-6

info:
    
***************************************************************************************************/

#include <mkheaders.h>
#include <gtest/gtest.h>


//将所有满足特定条件的元素替换为另一个值 
TEST(MSQ, replace)
{
    std::array<int, 10> s{5, 7, 4, 2, 8, 6, 1, 9, 0, 3};
    std::replace(s.begin(), s.end(), 2, 22);
    
    for (auto elem : s) {
        MK_PRINT_MSG("n = %d", elem);
    }
}
